{
  "tiles": [
    {
      "title": "Black Friday racks up $5.03B in online sales, $2B on mobile alone",
      "info": "The final figures for Black Friday online sales are in, and it’s another record-breaking day e-commerce in the U.S. Adobe says that shoppers spent $5.03 billion online in a race for bargains for themselves and to gift to others.The figures come the day after Thanksgiving racked up a record $2.87 billion in online sales Adobe analyses 80 percent of online transactions to the 100 largest web retailers in the country to come up with its numbers. The final figure surpassed its own estimates, where were for $5 billion of sales.",
      "likes": 6,
      "author": "author 1",
      "category": "technology",
      "id": 0
    },
    {
      "title": "India vs Sri Lanka: Murali Vijay gets back in the swing of things",
      "info": "Sometime in late August, Murali Vijay made a call to his friend Murthy Meghavan, who runs a surfing school on the Mamallapuram stretch near Chennai. The batsman had just returned from London after a wrist surgery and wanted to “stay aloof from negative thoughts” by surfing, a passion he has nurtured of late. Despite the initial hesitation — whether it was advisable for Vijay to surf when the injury wasn’t fully healed yet — his friend asked him to come over. It coincided with a surfing festival and Vijay took gleefully to the waves. About a week later, Vijay was a more positive person. The web of doubts was cleared and he was brimming with newfound energy ahead of another season.",
      "category": "Sports",
      "author": "author 2",
      "likes": 1,
      "id": 1
    },
    {
      "title": "Arun Jaitley responds to Rahul Gandhi's allegations over Rafale deal, says there was no 'Quattrocchi' involved this time",
      "info": "Ahmedabad: Union finance minister Arun Jaitley on Saturday hit back at Congress vice president Rahul Gandhi for questioning the Rafale fighter aircraft deal, saying unlike during Congress regimes when middlemen ruled the roost, there was no \"Quattrocchi\" in the contract for the fighter jet.\n\nJaitley, who is the BJP's election in-charge for Gujarat, was referring to Ottavio Quattrocchi, the Italian businessman believed to be involved in the Bofors scam which came to light when Rajiv Gandhi was prime minister.\n\n\n\"It (Rafale deal) was a government-to-government transaction, between two governments. It wasn't like what used to happen during Congress governments, when middlemen used to be there in every transaction. There wasn't any Quattrocchi in this transaction,\" Jaitley told reporters in Ahmedabad.",
      "category": "Politics",
      "author": "author 2",
      "likes": 2,
      "id": 2
    },
    {
      "title": "Domestic investors still sceptical about REITs: Survey",
      "info": "Even as foreign investors, primarily from the Asia-Pacific region, are expecting the country's maiden Real Estate Investment Trusts (REIT) to be launched in the first quarter of 2018, domestic investors are still in a wait-and-watch mode.\n\nAccording to a survey by PwC and Urban Land Institute, the maiden REIT is likely to be listed towards the end of the first quarter of 2018, providing a long-awaited exit route for investment funds now active in the market or a strategy for those planning to enter the domestic market.",
      "category": "Others",
      "author": "author 2",
      "likes": 0,
      "id": 3
    },
    {
      "title": "Lionel Messi signs a new contract with Barcelona",
      "info": "The Argentine superstar has been with Barcelona since 2000 when he joined as a 13-year-old and made his debut in the first team at the age of 16.\n\nThe new contract, signed on Saturday, will see Messi at Barcelona until 2021\nThe new contract, signed on Saturday, will see Messi at Barcelona until 2021\nThe 30-year-old's new contract has a £626 million buy-out clause and will see him at Barcelona until the end of the 2020/21 season.\n\nIn his time at the Nou Camp, Messi has helped Barcelona win eight La Liga titles, four Champions League titles and five Copa del Rey titles.\n\nMessi has scored 523 goals for Barcelona in 602 games\nMessi has scored 523 goals for Barcelona in 602 games\nThe number 10 has scored over 600 goals for club and country and has been awarded the Ballon d'Or five times, more than any other player.",
      "category": "Sports",
      "author": "author 1",
      "likes": 1,
      "id": 4
    },
    {
      "title": "China hints it can rename CPEC if India joins OBOR initiative",
      "info": "BEIJING: The Chinese foreign ministry on Thursday responded to a statement by its ambassador in India, Luo Zhaohui, who recently said Beijing is prepared to rename the China-Pakistan Economic Corridor (CPEC) to address India's concerns+ . The ministry neither endorsed nor denied Luo's statement, suggesting that it was encouraging Luo to negotiate with New Delhi over the issue, while ensuring that it did not upset Islamabad either.\nThe ambassador had said during a speech in Delhi last week that China \"can change the name of CPEC\" and \"create an alternative corridor through Jammu & Kashmir, Nathu La pass or Nepal to deal with India's concerns\".\nIn return, it was suggested that India join its One Belt One Road (OBOR) connectivity plan which desperately needs a boost from China's largest neighbour to its south. Chinese investments in Nepal and Myanmar are meant to pressure India to join the initiative but India has not responded to these overtures so far.",
      "category": "Politics",
      "author": "author 1",
      "likes": 0,
      "id": 5
    },
    {
      "title": "Graviky Labs: Converting air pollution to ink  ",
      "info": "The company has raised Rs 80 lakh at a valuation of Rs 80 crore. The investment was raised from Mohit Goel, CEO, Omaxe Limited \n\nEarly November this year, Delhi knocked every other city in the world to bag the position of being the world's most polluted city. Pollution from increasing number of vehicles, dust, farmers burning crop stubble in neighboring states and fire crackers after the festival of Diwali meant the national capital was covered in a thick blanket of toxic smog. ",
      "category": "Technology",
      "author": "author 2",
      "likes": 1,
      "id": 6
    },
    {
      "title": "End of road for 'cheapest car': Dealers stop placing orders for Tata Nano",
      "info": "Tata Motors’ Nano, the cheapest car launched in recent times, is now also among models clocking lowest monthly production and sales volume (in double digits to be precise). The average daily production of just two Nano cars at the company’s Sanand plant is indication enough that this vehicle is now as good as obsolete. Dealers of Tata Motors in most parts of the country have stopped placing orders for this small car in the last three-four months and the showrooms are displaying contemporary models such as Tiago, Tigor, Hexa and Nexon.   \n\nHere are the numbers: Tata Motors dispatched 180 Nanos to its 630 sales outlets this August (against 711 in August 2016). The number came down to 124 units in September and further dipped to just 57 units in October. September and October were festive months with high demand for car. It was also reported last week that production of electric Nano is underway for a launch soon through a joint venture with Tata Motors and Coimbatore-based Jayem Automotives. It was reported that this new car will be called Neo, dealing a death  blow to Nano. ",
      "category": "Others",
      "author": "author 1",
      "likes": 1,
      "id": 7
    }
  ],
  "users": [
    {
      "id": 0,
      "author": "author 1",
      "password": "author 1",
      "favourites": [
        "4",
        "1",
        "6",
        "7",
        "2",
        "0"
      ]
    },
    {
      "id": 1,
      "author": "author 2",
      "password": "author 2",
      "favourites": [
        "2"
      ]
    }
  ]
}